Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: དེ་ནས་གང་གི་ཚེ་དེ་ལ་བུ་ཆགས་པར་གྱུར་པ་དེའི་ཚེ་དེ་དགའ་ཆེས་ནས་ཁྱིམ་ཐབ་ལ་སྦྲན་པ།
en: When the householder’s wife conceived a child, she was overjoyed and told her husband,

source: ཇོ་བོ་བདག་ལ་སྲས་ཆགས་ཏེ།
en: “My lord, I have conceived a boy.

source: བདག་གི་རུམ་གཡས་ལོགས་སུ་རྟེན་ཅིང་གནས་པ་ལས་ན་ཁྱེའུར་འགྱུར་བར་ངེས་ཀྱིས། དགྱེས་པ་བསྐྱེད་དུ་གསོལ་ཞེས་བྱས་ནས།
en: He is staying on the right side of my womb, so rejoice, for it is sure to be a boy!”

source: དེ་ཡང་དགའ་ཆེས་ཏེ་རོ་སྟོད་ནི་བཏེག་ལག་པ་གཡས་པ་ནི་བརྐྱང་ནས།
en: At this the householder too was very happy. He puffed out his chest, put his right hand in the air, and expressed his joy, saying,

source: བདག་གིས་ཡུན་རིང་པོ་ནས་སྨོན་སྨོན་པའི་བུའི་ངོ་མཐོང་བར་འོང་ངོ་། །
en: “I shall see the face of the son for whom I have prayed for so long!

source: བདག་གི་བུ་རུང་བར་གྱུར་ཅིག་མི་རུང་བར་མ་གྱུར་ཅིག །བདག་གི་བྱ་བ་དག་བྱེད་པར་ཤོག་ཤིག །
en: May everything be right with my son, may nothing go wrong with him, and may he carry on my work!

source: གསོས་ན་གསོས་པའི་ལན་ཕྱིར་གསོ་བར་ཤོག་ཤིག །
en: As I care for him, may he care for me in return!

source: ནོར་སྐལ་ལ་སྤྱོད་པར་ཤོག་ཤིག །
en: May he enjoy my inheritance!

source: བདག་གི་རིགས་རྒྱུད་ཡུན་རིང་དུ་གནས་པར་ཤོག་ཤིག །
en: May my lineage endure for a long time!

source: བདག་ཅག་འདས་ཏེ་ཤི་བའི་འོག་ཏུ་ཡང་བདག་ཅག་གི་ཕྱིར་མང་ཡང་རུང་ཉུང་ཡང་རུང་སྟེསྦྱིན་པ་དག་བྱིན་ལ་བསོད་ནམས་དག་བྱས་ནས་
en: And after our passing, when we die, may he give gifts, be they great or small, and make merit! When he does, may he dedicate the merit thus:

source: དེ་གཉིས་གང་དང་གང་དུ་སྐྱེས་ཤིང་འགྲོ་བ་དེར་འདི་སོང་ཤིག་ཅེས་ཡོན་སྔོ་བར་ཤོག་ཤིག་ཅེས་དགའ་བའི་ཚིག་བརྗོད་དོ། །
en: ‘Wherever these two are born, may this go to them!’ ”

source: དེས་བུ་ཆགས་པར་རིག་ནས་བུའི་རིམ་གྲོ་བྱ་བའི་ཕྱིར་ཁང་བཟངས་ཀྱི་སྟེང་དུ་ཉམ་རངས་སུ་བཞག་སྟེ།
en: Now that he knew his wife was pregnant, he ensconced her on the upper levels of their house in order to care for the baby.

source: གྲང་བའི་ཚེ་གྲང་བའི་ཡོ་བྱད་རྣམས་དང་ཚ་བའི་ཚེ་ཚ་བའི་ཡོ་བྱད་རྣམས་དང་།
en: He provided her with what she needed for winter in the winter, what she needed for summer in the summer,

source: སྨན་པས་བསྟན་པའི་ཟས་རྣམས་དང་ཧ་ཅང་ཁ་བ་མ་ཡིན་པ་རྣམས་དང་ཧ་ཅང་སྐྱུར་བ་མ་ཡིན་པ་རྣམས་དང་ཧ་ཅང་ལན་ཚྭ་ཆེ་བ་མ་ཡིན་པ་རྣམས་དང་ཧ་ཅང་མངར་བ་མ་ཡིན་པ་རྣམས་དང་། ཧ་ཅང་རོ་ཚ་བ་མ་ཡིན་པ་རྣམས་དང་ཧ་ཅང་བསྐ་བ་མ་ཡིན་པ་རྣམས་ཏེ། ཁ་བ་དང་སྐྱུར་བ་དང་ལན་ཚྭ་དང་མངར་བ་དང་ཚ་བ་དང་བསྐ་བ་མེད་པའི་ཟས་རྣམས་ཀྱིས་བསྟེན་ཅིང་།
en: with food that was not too bitter, too sour, too salty, too sweet, too spicy, or too astringent as instructed by the healer, and he served her food that was not bitter, sour, salty, spicy, sweet, or astringent.

source: དོ་ཤལ་དང་སེ་མོ་དོས་ལུས་རྣམ་པར་བཀླུབས་ཏེ། ལྷའི་བུ་མོ་དགའ་བའི་ཚལ་ན་རྣམ་པར་རྒྱུ་བ་བཞིན་དུ། ལུས་ཁྲིའི་སྟེང་ནས་ཁྲིའི་སྟེང་དང་། ཁྲིའུའི་སྟེང་ནས་ཁྲིའུའི་སྟེང་དུ་རྒྱུ་ཞིང་འོག་གི་ས་གཞི་ལ་མི་འབབ་པ་དང་། དེས་ཡིད་དུ་མི་འོང་བའི་སྒྲ་སྐད་ཅི་ཡང་མི་ཐོས་པར་བྱས་སོ། །
en: He draped her body with garlands and strings of precious stones, and he moved her from divan to divan and seat to seat like a goddess through a joyous garden, never letting her descend to the ground, and never letting her hear an unpleasant word even for a moment.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་བགྲོད་པ་གཅིག་པུའི་ལམ་སྟོན་པ། རྣམ་པ་གཉིས་ཀྱི་ཤེས་བྱ་དང་ཡེ་ཤེས་ལ་མངའ་བརྙེས་པ། མ་འདྲེས་པའི་དྲན་པ་ཉེ་བར་གཞག་པ་གསུམ་ལ་མཁས་པ། མི་འཇིགས་པ་བཞིས་མི་འཇིགས་པ། འགྲོ་བ་ལྔར་འགྲོ་བ་ལས་རྣམ་པར་གྲོལ་བ།
en: The blessed buddhas, teachers of the one path to be traversed, with mastery over wisdom and the two types of knowable objects, in command of the three kinds of sterling equanimity, fearless by means of the fourfold fearlessness, freed from migration through the five destinies,

source: སྐྱེ་མཆེད་དྲུག་ལ་མཁས་པ་བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་ལ་སྤྱོད་ཡུལ་བ། རྣམ་པར་ཐར་པ་བརྒྱད་ལ་བསམ་གཏན་པ། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་ལ་སྙོམས་པར་འཇུག་པ། སྟོབས་བཅུའི་སྟོབས་དང་ལྡན་པ་ཡང་དག་པའི་སེང་གེའི་སྒྲ་ཆེན་པོ་སྒྲོགས་པ་རྣམས་ནི།
en: keen in the six sense bases, practiced in the seven limbs of enlightenment, focused on the eight liberations, absorbed in the nine successive meditative absorptions, possessing all ten of the ten powers, whose proclamations are the great roaring of a perfect lion,

source: ཆོས་ཉིད་ཀྱིས་ཉིན་དུས་གསུམ་མཚན་དུས་གསུམ་སྟེ། ཉིན་མཚན་དུས་དྲུག་ཏུ་སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་འཇིག་རྟེན་ལ་གཟིགས་ཏེ།
en: by nature regard the world with their buddha eyes six times throughout the day and night—three times by day and three times by night. These are their thoughts as they look out in wisdom:

source: སུ་ནི་ཕོངས་ཤིང་འདུག་
en: Who is destitute?

source: སུ་ནི་གནོད་པ་དང་ལྡན་
en: Who is being harmed?

source: སུ་ནི་འཕགས་པའི་ནོར་བདུན་མེད་པ་ལས། འཕགས་པའི་ནོར་བདུན་གྱི་དབང་ཕྱུག་ལ་དབང་བྱེད་དུ་གཞུག་པར་བྱ།
en: Whom, lacking the seven jewels of the noble ones, shall I lead to command of the seven jewels of the noble ones?

source: དེ་བཞིན་དུ་ཉན་ཐོས་ཆེན་པོ་རྣམས་ཀྱང་ཉིན་དུས་གསུམ་མཚན་དུས་གསུམ་སྟེ། ཉིན་མཚན་དུས་དྲུག་ཏུ་ཉན་ཐོས་ཀྱི་མིག་གིས་འཇིག་རྟེན་ལ་ལྟ་བར་བྱེད་དེ།
en: so too the great listeners regard the world with their listener’s eyes six times throughout the day and night—three times by day and three times by night.

source: ཚེ་དང་ལྡན་པ་མ་འགགས་པས་ཉན་ཐོས་ཀྱི་མིག་གིས་འཇིག་རྟེན་ལ་བལྟས་ན།
en: When Venerable Aniruddha regarded the world with his listener’s eyes,

source: སྲིད་པ་ཐ་མ་པའི་སེམས་ཅན་ཞིག་གིས་ཁྱིམ་བདག་དེའི་ཁྱིམ་དུ་ཉིང་མཚམས་སྦྱོར་བར་མཐོང་ངོ་། །མཐོང་ནས་ཀྱང་བསམས་པ་སེམས་ཅན་དེ་སུས། འདུལ་བར་འགྱུར། ཅི་སངས་རྒྱས་ཀྱིས་འདུལ་བར་འགྱུར་རམ། འོན་ཏེ་ཉན་ཐོས་ཀྱིས་འདུལ་བར་འགྱུར་ཞིག་གུ་སྙམ་པ་དང་
en: he saw a being who was in his final birth taking birth in the home of that householder, and he thought, “Who will tame this being? Will he be tamed by the Buddha, or will he be tamed instead by the listeners?”

source: དེས་བདག་ཉིད་ཀྱིས་འདུལ་བར་འགྱུར་བ་མཐོང་ངོ་། །མཐོང་ནས་ཀྱང་ཁྱིམ་དེར་སོང་ནས།
en: Then he saw that it was he himself who would tame him and went to the house.

source: ཁྱིམ་བདག་དེ་ལ་དུས་དུས་སུ་ཆོས་སྟོན་ཏོ། །དེས་ཁྱིམ་བདག་དེ་དད་པ་ཕུན་སུམ་ཚོགས་པ་ལ་གནས་པར་བྱས་སོ། །སྐྱབས་སུ་འགྲོ་བ་དང་། བསླབ་པའི་གཞི་རྣམས་ལ་ཡང་གནས་པར་བྱས་སོ། །
en: He gave Dharma teachings to the householder from time to time, and that led the householder to remain steadfast in perfect faith, to take refuge, and to maintain the fundamental precepts.

source: སྦྱིན་པ་དང་སྦྱིན་པའི་བགོ་བཤའ་ལ་ཡང་དད་པར་བཙུད་དེ། དེས་རིང་པོ་མ་ལོན་པར། ཁྱིམ་དེ་སློང་བ་རྣམས་ཀྱི་ཆུ་དོང་དང་འདྲ་བར་གྱུར་པར་བྱས་སོ།།
en: He inspired him to give gifts and to share what they had, and in no time at all his home became like an open well for those in need.

source: དེ་ནས་ཕྱི་ཞིག་ན། ཚེ་དང་ལྡན་པ་མ་འགགས་པས། ཕ་མ་དེ་གཉིས་བརྟན་པར་བྱ་བའི་ཕྱིར་ཟླ་མེད་པ་དང་། གཡོག་མེད་པར་གཅིག་པུ་ཁྱིམ་དེར་སོང་བ་དང་
en: To strengthen the parents’ resolve, one day Venerable Aniruddha went to the house alone, without companions or attendants.

source: ཁྱིམ་བདག་དེས། ཚེ་དང་ལྡན་པ་མ་འགགས་པ་ཟླ་མེད་པ་དང་། གཡོག་མེད་པར་གཅིག་པུ་འོང་བར་མཐོང་ངོ་། །མཐོང་ནས་ཀྱང་
en: The householder saw that Venerable Aniruddha was alone, without companions or attendants, and asked,

source: འཕགས་པའི་ཞབས་འབྲིང་བགྱིད་པ་འགའ་ཡང་མ་མཆིས་སམ་ཞེས་དྲིས་སོ། །
en: Noble one, is there no one at all who could attend you?”

source: ཚེ་དང་ལྡན་པ་མ་འགགས་པས་སྨྲས་པ། ཁྱེད་ཅག་ལྟ་བུ་འབའ་ཞིག་གིས་བྱིན་པ་མ་གཏོགས་པར་བདག་ཅག་ལ་གུད་ན་གཡོག་གི་འབྱུང་ཁུངས་ག་ལ་ཡོད།
en: “Where shall we find attendants, if one such as yourself does not grant them to us?” replied Venerable Aniruddha.

source: བཙུན་པ་མ་འགགས་པ་བདག་གི་མཆིས་བྲང་ལ་བུ་ཆགས་པ་མཆིས་ཀྱིས་དེ་ལས། གལ་ཏེ་ཁྱེའུ་ཞིག་བཙས་པར་གྱུར་ན། དེ་བདག་གིས་འཕགས་པའི་ཞབས་འབྲིང་དུ་དབུལ་ལོ། །
en: “Lord Aniruddha, my wife has conceived, so if we have a son, noble one, I shall offer him to you as an attendant.”

source: ཚེ་དང་ལྡན་པ་མ་འགགས་པས་སྨྲས་པ། ཁོང་དགེ་བ་རྣམས་ནི་དམ་བཅས་པ་ལ་བརྟན་པ་ཡིན་ནོ། །
en: “The virtuous keep their promises,” said Venerable Aniruddha.

source: དེ་སྐད་ཅེས་སྨྲས་ནས། ཚེ་དང་ལྡན་པ་མ་འགགས་པ་སོང་ངོ་། །
en: Having spoken thus, Venerable Aniruddha departed.

source: ཁྱིམ་བདག་དེའི་ཆུང་མ་ཡང་ཟླ་བ་དགུ་འམ་བཅུ་ལོན་པ་དང་ཁྱེའུ་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པ་མདོག་བཟང་བ་གསེར་གྱི་ཁ་དོག་ཅན་མགོ་གདུགས་ལྟར་འདུག་པ་ལག་པ་རིང་བ་དཔྲལ་བའི་དབྱེས་ཆེ་བ། སྣ་མཐོ་བ་སྣ་ལེགས་པ་སྨིན་མ་སྟུག་པ་ཞིག་བཙས་སོ། །
en: After nine or ten months had passed, the householder’s wife gave birth to a child who was well proportioned, pleasing to the eye, and beautiful, with glowing, golden skin and a well-rounded head, long arms, a broad brow, a fine and prominent nose, and eyebrows that met.

source: དེ་ནས་དེའི་བཙས་སྟོན་རྒྱས་པར་བྱས་ནས། ཁྱེའུ་འདིའི་མིང་ཇི་སྐད་གདགས་ཞེས་
en: At the elaborate feast celebrating his birth they asked, “What name should we give this child?”

source: མིང་འདོགས་པར་བྱེད་དེ། བདག་གི་བུ་ནམ་བཙའ་བར་འགྱུར་ཞིག་གུ་སྙམ་དུ་ཡུན་རིང་པོ་ནས། བདག་གིས་སྨོན་སྨོན་པ་དང་ཡུན་རིང་པོ་ནས་བདག་འདོད་ཅིང་། ཡིད་སྨོན་དུ་བགྱི་བགྱི་བ་དེ།
en: And the householder named him, saying, “For so long I wondered when I would have a child, and for so long I prayed and prayed.

source: ཁྱེའུ་འདིས་ཡོངས་སུ་རྫོགས་པར་བྱས་པས་ན། ཁྱེའུ་འདིའི་མིང་རྫོགས་བྱེད་ཅེས་གདགས་སོ་ཞེས་ཟེར་རོ། །
en: Since this child has fulfilled my wish, his name will be Pūraṇa .”

source: དེ་ནས་ཁྱེའུ་རྫོགས་བྱེད་པང་ན་འཚོ་བའི་མ་མ་གཉིས་དང་། ནུ་མ་སྣུན་པའི་མ་མ་གཉིས་དང་དྲི་མ་འཁྲུ་བའི་མ་མ་གཉིས་དང་རྩེ་བའི་མ་མ་གཉིས་ཏེ་མ་མ་བརྒྱད་ལ་གཏད་ནས
en: Baby Pūraṇa had eight nurses—two nurses to hold him in their laps, two wet nurses, two nurses to bathe him, and two nurses to play with him.

source: དེ་སྲེད་མེད་ཀྱི་བུའི་ལག་ན་ཐོགས་པའི་རྨ་བྱའི་མདོངས་དང་བསྲུང་བའི་སྲད་བུ་དང་འོ་མ་དང་ཞོ་དང་མར་དང་ཞུན་མར་དང་མར་གྱི་ཉིང་གུས་བསྐྱེད་བསྲིངས་ཏེ།
en: They raised him with a protection cord, and the eye of a peacock feather from the hand of Nārāyaṇa. They reared him on milk, yogurt, butter, ghee, and milk solids,

source: མཚོའི་ནང་གི་པད་མ་བཞིན་དུ་སྐྱེད་དྲག་པར་གྱུར་ཏོ། །
en: and he flourished like a lotus in a lake.

source: དེ་གང་གི་ཚེ་ཆེར་སྐྱེས་པ་དེའི་ཚེ། ཡི་གེ་དང་ཁོང་རྩིས་དང་ཤོད་དགོད་པ་དང་ལག་རྩིས་དང་དབྱུང་བ་དང་སྦ་བ་དང་དགྲམ་པ་དང་
en: As he grew up he studied letters, tallying, and arithmetic; the study of seals, lending, deposits, and commerce;

source: གོས་བརྟག་པ་དང་ནོར་བུ་བརྟག་པ་དང་རིན་པོ་ཆེ་བརྟག་པ་དང་སྤོས་བརྟག་པ་དང་སྨན་བརྟག་པ་དང་གླང་པོ་ཆེ་བརྟག་པ་དང་རྟ་བརྟག་པ་དང་གོ་མཚོན་བརྟག་པ་བསླབས་ཏེ།
en: and the examination of cloth, jewels, gems, incense, medicine, elephants, horses, and arms and armor.

source: ཡི་གེ་མཁས་པ་དང་ཀློག་མཁས་པ་དང་མཛངས་པ་དང་བྱ་བ་ལ་གསལ་བ་དང་ཡིད་གཞུངས་པ་དང་བརྟག་པ་རྣམ་པ་བརྒྱད་ལ་བྱང་བར་གྱུར་ཏོ། །
en: He became skilled in writing, skilled at reading, learned, decisive, industrious, a master of the eight types of examination.

source: དེ་ནས་ཕྱི་ཞིག་ན། ཚེ་དང་ལྡན་པ་མ་འགགས་པས། ཁྱེའུ་དེ་རབ་ཏུ་དབྱུང་བའི་དུས་ལ་བབ་པར་མཐོང་ནས།
en: One day Venerable Aniruddha saw that the time had come for the child to go forth.

source: སྔ་དྲོ་ཤམ་ཐབས་དང་ཆོས་གོས་བགོས་ཏེ།
en: In the morning he donned his lower garment and Dharma robes, and,

source: ལྷུང་བཟེད་ཐོགས་ནས་མཉན་དུ་ཡོད་པར་བསོད་སྙོམས་ལ་སོང་སྟེ།
en: carrying his alms bowl, he went for alms in Śrāvastī.

source: དེ་མཐར་གྱིས་བསོད་སྙོམས་ལ་རྒྱུ་བ་ལས། ཁྱིམ་བདག་དེའི་ཁྱིམ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས། སྟན་བཤམས་པ་ལ་འདུག་གོ། །
en: As he went for alms, eventually he came to the householder’s home, and there sat on the seat prepared for him.

source: འདུག་ནས་ཀྱང་ཚེ་དང་ལྡན་པ་མ་འགགས་པས། ཁྱིམ་བདག་དེ་ལ་སྨྲས་པ།
en: After he had taken his seat, Venerable Aniruddha reminded the householder,

source: ཁྱིམ་བདག་ཁྱེའུ་འདི་ནི་མ་བཙས་པའི་སྔ་རོལ་ནས། ཁྱོད་ཀྱིས་བདག་གི་གཡོག་ཏུ་བྱིན་ཏེ།
en: “Householder, before this child was born you granted him to me as an attendant.

source: ཁྱེའུ་དེ་ལག་པ་གཉིས་ཀྱིས་བཟུང་སྟེ། ཚེ་དང་ལྡན་པ་མ་འགགས་པ་ལ་ཕུལ་ནས་སྨྲས་པ།
en: Having said this, he took the child by his two hands, offered him to Venerable Aniruddha, and told him,

source: བུ་ཁྱོད་མ་བཙས་པའི་སྔ་རོལ་ནས། འཕགས་པ་ལ་ངས་ཕུལ་གྱིས་སོང་ལ་འཕགས་པའི་ཞམ་རིང་གྱིས་ཤིག །
en: “Child, before you were born I offered you to the noble one. Therefore go, and be the noble one’s attendant.”

source: དེ་ནི་བདག་ལ་ཕན་གདགས་པ་ལགས་སོ་ཞེས་བྱས་ནས།
en: “This will be of benefit to me.”

source: ཁྱེའུ་དེ་ཚེ་དང་ལྡན་པ་མ་འགགས་པའི་ཕྱི་བཞིན་འབྲང་སྟེ།
en: With those words the child followed Venerable Aniruddha away.

source: ཁྱེའུ་དེ་ཚེ་དང་ལྡན་པ་མ་འགགས་པས། གཙུག་ལག་ཁང་དུ་ཁྲིད་ནས། རབ་ཏུ་ཕྱུང་སྟེ། བསྙེན་པར་རྫོགས་པར་བྱས་ནས་དེ་ལ་ལུང་ཡང་ཕོག་གོ། །
en: Venerable Aniruddha brought the child to the monastery, where he led him to go forth as a novice, fully ordained him, and instructed him.

source: དེ་ནས་དེ་སྲོད་དང་ཐོ་རངས་མི་ཉལ་བར་བརྩོན་པ་ལྷུར་བྱེད་པ་ལ་གནས་ཀྱང་ཁྱད་པར་ཅུང་ཟད་ཀྱང་མ་ཐོབ་ནས།
en: But despite his commitment to practice earnestly, foregoing sleep from dusk to dawn, the child did not achieve anything of significance.

source: དེ་ཕྱི་ཞིག་ན་ནད་ཀྱིས་ཐེབས་ནས།
en: Then he fell ill.

source: དེའི་ཕ་མ་གཉིས་ཀྱིས་བུ་ནད་ཀྱིས་ཐེབས་སོ་ཞེས་ཐོས་ནས།
en: His parents heard that their child had taken ill,

source: ཐོས་མ་ཐག་ཏུ་དེའི་ཕ་མ་གཉིས་ཀྱིས་སྨན་པ་ཁྲིད་དེ། ཡོ་བྱད་ཐམས་ཅད་ཁྱེར་ནས། གཙུག་ལག་ཁང་དུ་སོང་སྟེ།
en: and as soon as they heard this they brought a healer to visit him, and went to the monastery carrying everything he needed.

source: ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་བསྙེན་བཀུར་བྱས་ཀྱང་སོས་པར་བྱེད་མ་ནུས་ནས།
en: They provided for all his needs, but they could not cure him.

source: དེ་གཉིས་ཀྱིས་བསམས་པ།
en: They thought,

source: བདག་ཅག་གཉིས་གཙུག་ལག་ཁང་དུ་འདུག་ན་ནི་ཁྱིམ་གྱི་བྱ་བ་མང་པོ་དག་ཤོར་བར་འགྱུར་ན་
en: “If we remain here at the monastery we will fall behind on all our work at home.

source: མ་ལ་བུ་འདི་ཁྱིམ་དུ་ཁྲིད་ལ་དེ་ཉིད་དུ་ནད་གཡོག་བྱའོ་སྙམ་དུ་བསམས་ནས
en: We should bring the child home and care for him there.”

source: ཚེ་དང་ལྡན་པ་མ་འགགས་པའི་རྐང་པ་ལ་ཕྱག་འཚལ་ཏེ་སྨྲས་པ།
en: They bowed down at Venerable Aniruddha’s feet and said,

source: འཕགས་པ་མཁྱེན་པར་མཛད་དུ་གསོལ། བདག་ཅག་གཉིས་འདི་ན་མཆིས་ན་ནི་ཁྱིམ་གྱི་བགྱི་བ་མང་པོ་དག་ཤོར་བར་འགྱུར་ན།
en: “Noble one, please know that if we stay here, we will fall behind on all our duties at home.

source: བདག་ཅག་གཉིས་ཀྱིས་བུ་འདི་ཁྱིམ་དུ་ཁྲིད་དེ་ནད་གཡོག་བགྱི་བར་འཚལ་ན་གནང་བར་མཛད་དུ་གསོལ་ཞེས་བྱས་སོ། །
en: We request your permission to bring our child back home, so we can tend to him there.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་མ་འགགས་པས་བསམས་པ།
en: Venerable Aniruddha thought,

source: དགེ་སློང་འདིས་ཁྱིམ་དེ་ཉིད་དུ་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱེད་པར་འགྱུར་ལ། ཕ་མ་གཉིས་དང་ཁྱིམ་མི་རྣམས་ཀྱང་བདེན་པ་རྣམས་ལ་འགོད་པར་འགྱུར་རོ་
en: “His parents and the people of their house will soon be established in the truths, for this monk will manifest arhatship there in the house.”

source: སྙམ་དུ་རིག་ནསཚེ་དང་ལྡན་པ་མ་འགགས་པས་སྨྲས་པ།
en: With this in mind, Venerable Aniruddha said,

source: ཁྱེད་གཉིས་ཇི་ལྟར་དགའ་བ་བཞིན་དུ་གྱིས་ཤིག །
en: “Do as you wish.”

source: དེ་ནས་དེ་སྐད་ཐོས་པའི་མོད་ལ། ཁྱིམ་བདག་དེས། དགེ་སློང་དེ་བདག་གི་ཁྱིམ་དུ་ཁྲིད་དེ། སྨན་པའི་ལུང་བཞིན་དུ་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་ནད་གཡོག་བྱས་སོ། །
en: As soon as they heard this, the householders brought the monk back to their house and provided for all his needs according to the healer’s instructions.

source: དགེ་སློང་དེས་ཀྱང་ཁྱིམ་དེ་ཉིད་ན་འདུག་བཞིན་དུ་ནད་ཀྱིས་སྐྱོ་བར་གྱུར་ནས། བརྩོན་པ་དང་བསྒྲུབ་པ་དང་འབད་པས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ནས། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་ཏེ།
en: Right there in the house, disillusioned by his illness, the monk cast away all afflictive emotions through diligence, practice, and effort, and manifested arhatship.

source: དེས་དགྲ་བཅོམ་པ་ཐོབ་ནས་ཕ་མ་གཉིས་དང་ཁྱིམ་གྱི་མི་རྣམས་ཀྱི་བསམ་པ་དང་བག་ལ་ཉལ་དང་ཁམས་དང་རང་བཞིན་རྟོགས་ནས་དེ་དང་འཐུན་པའི་ཆོས་བསྟན་ཏེ།
en: As an arhat he directly apprehended the thoughts, habitual tendencies, temperament, and nature of his two parents and the people of their house, and taught them the Dharma accordingly.

source: དེ་ཐོས་ནས་ཁྱིམ་བདག་དེ་འཁོར་དང་བཅས་པས་སྟན་དེ་ཉིད་ལ་འདུག་བཞིན་དུ་འཇིག་ཚོགས་ལ་ལྟ་བའི་རིའི་རྩེ་མོ་མཐོན་པོ་ཉི་ཤུ་ཡེ་ཤེས་རྡོ་རྗེས་བཅོམ་ནས། རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་ཏེ།
en: Hearing it, the householders and their retinue destroyed with the thunderbolt of wisdom the twenty high peaks of the mountain of views concerning the transitory collection, and manifested the resultant state of stream entry right where they sat.

source: དེས་ཕ་མ་གཉིས་བདེན་པ་རྣམས་ལ་བཀོད་ནས། བདག་ཉིད་ཀྱི་སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་པར་བྱེད་དེ། བདག་གང་ནས་འཆི་འཕོས་གང་དུ་སྐྱེས་སྙམ་དུ་བསམས་ནས།
en: After establishing his parents in the truth, he thought, “I have recollection of my former states—whence I died and transmigrated, and where I have taken rebirth.

source: དེས་མི་ལས་ཤི་འཕོས་ཏེ། མི་ཉིད་དུ་སྐྱེས་ལ་ཐམས་ཅད་དུ་ཡང་ནད་མང་བ་དང་། ཚེ་ཐུང་བར་གྱུར་པར་མཐོང་ནས།
en: I see that from life to life I have died as a human being and taken rebirth as a human being, but I am always very ill, and my lifespan very short.

source: དེས་བསམས་པ་བདག་སོ་སོའི་སྐྱེ་བོར་གྱུར་པས།
en: “I have been an ordinary person,” he thought.

source: འདི་ལྟ་བུའི་སྡུག་བསྔལ་ཉམས་སུ་མྱོང་བར་གྱུར་ལ།
en: “That’s why I’m undergoing such agonies.

source: ད་ནི་བདག་གིས་བྱ་བ་བྱས་ཟིན་པས། བདག་ལ་སྡུག་བསྔལ་འདི་ལྟ་བུ་ཅི་དགོས་ཀྱིས། མ་ལ་བདག་ཞི་བའི་དབྱིངས་སུ་འཇུག་པར་བྱའོ་
en: But now that I have done what was before me, what need do I have for such suffering?

source: སྙམ་དུ་བསམས་ནས
en: Let me enter the sphere of peace!”

source: འབར་བ་དང་ལམ་མེར་འདུག་པ་དང་། ཆར་འབབ་པ་དང་གློག་འགྱུ་བའི་ཆོ་འཕྲུལ་རྣམས་བསྟན་ཏེ།
en: After reflecting in this way, he made a miraculous display of fire and light, rain and lightning, and

source: ཕུང་པོ་ལྷག་མ་མེད་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་སོ། །
en: passed beyond all sorrow into the realm of nirvāṇa without any remainder of the aggregates.

source: དེ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས།
en: After he passed into parinirvāṇa,

source: ཕ་མ་གཉིས་ཀྱིས་དེ་ཁྱོགས་རས་སྔོན་པོ་དང་། སེར་པོ་དང་དམར་པོ་དང་དཀར་པོ་རྣམས་ཀྱིས་བརྒྱན་པའི་སྟེང་དུ་བཞག་སྟེ་ཁྱེར་བར་བྱས་ན། ཁྱོགས་གདེག་པར་མ་ནུས་ནས།
en: his parents laid his body on a palanquin festooned with blue, yellow, red, and white cloth, but they were unable to lift it.

source: དེ་དག་ཚེ་དང་ལྡན་པ་མ་འགགས་པའི་ཐད་དུ་སོང་སྟེ་བསྙད་དོ། །དེ་ནས་ཚེ་དང་ལྡན་པ་མ་འགགས་པས་དྲན་པར་བྱས་ཏེ། བསམས་ན་དེ་ཉིད་ཀྱིས། དེ་ལྟ་བུར་འགྱུར་བའི་སྨོན་ལམ་བཏབ་པར་རིག་ནས་བཅོམ་ལྡན་འདས་ལ་གསོལ་ཏེ།
en: They went and told this to Venerable Aniruddha, who reflected on this, and, knowing that the monk had prayed it would be so, went and informed the Blessed One.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་ཆོས་གོས་དག་གྱོན་ལ། དགེ་སློང་དེའི་མཆོད་པའི་ལས་བྱེད་དུ་འདོང་ངོ་ཞེས་བཀའ་སྩལ་ནས། བཅོམ་ལྡན་འདས་དགེ་སློང་གི་ཚོགས་ཀྱིས་ཞམ་རིང་བྱས་ཏེ། དགེ་སློང་གི་དགེ་འདུན་གྱིས་མདུན་དུ་བདར་ནས། ཁྱིམ་བདག་དེའི་ཁྱིམ་ག་ལ་བ་དེར་གཤེགས་སོ། །
en: The Blessed One said, “Monks, don your Dharma robes, for we shall go and venerate that monk,” and set out for the householder’s home surrounded and attended by an assembly of monks.

source: སྐྱེ་དགུའི་བདག་མོ་ཆེན་མོ་གཽ་ཏ་མཱིས་ཀྱང་ཁྱིམ་བདག་ཆེ་གེ་མོ་ཞིག་གི་བུ་རབ་ཏུ་བྱུང་ནས། དེ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱང་དེ་ལ་མཆོད་པ་དང་བཀུར་སྟིར་མཛད་པར་བཞེད་དོ་ཞེས་ཐོས་ཏེ།
en: Mahā­prajāpatī Gautamī also heard that such-and-such a householder’s child had go forth and passed into parinirvāṇa, and that even the Blessed One had gone to venerate and pay homage to him.

source: དེ་ལྟར་རིག་ནས། དེས་ཀྱང་དེའི་སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་པར་བྱས་ཏེ་འཁོར་ལྔ་བརྒྱ་དང་ཁྱིམ་བདག་དེའི་ཁྱིམ་ག་ལ་བ་དེར་དོང་ངོ་། །
en: Knowing this, and remembering the child’s previous states, she also went to the householder’s home with five hundred attendants.

source: ཁྱིམ་བདག་མགོན་མེད་ཟས་སྦྱིན་དང་བཙུན་མོའི་འཁོར་གྱི་བླ་དྲང་སྲོང་སྦྱིན་དང་གནའ་མིས་ཀྱང་ཐོས་སོ། །
en: The householder Anāthapiṇḍada and the queen’s attendants, the sages Datta and Purāṇa, also heard this.

source: དགེ་བསྙེན་མ་ས་ག་དང་། དགེ་བསྙེན་མ་ལེགས་སྐྱེས་མས་ཀྱང་ཁྱིམ་བདག་ཆེ་གེ་མོ་ཞིག་གི་བུ་རབ་ཏུ་བྱུང་ནས། དེ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱང་དེའི་མཆོད་པ་དང་བཀུར་སྟི་མཛད་པར་བཞེད་དོ་ཞེས་ཐོས་སོ། །
en: The lay vow holder Vaiśākhā and the lay vow holder Sujātā also heard that the child of such-and-such a one had go forth and passed into parinirvāṇa, and that even the Blessed One had gone to venerate and pay homage to him.

source: ཐོས་ནས་དེ་དག་ཀྱང་འཁོར་དང་བཅས་པར་དེར་དོང་སྟེ། དེ་དག་གིས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་ཕྱག་འཚལ་ནས་གསོལ་པ།
en: Hearing this, they too went there with their attendants, bowed down at the feet of the Blessed One, and said,

source: དགེ་སློང་འདི་ཡི་སྐུ་གདུང་གི་མཆོད་པ་བདག་ཅག་བགྱིད་ཀྱིས། བཅོམ་ལྡན་འདས་འོ་བརྒྱལ་མི་འཚལ་ལོ། །
en: “We shall build the monk’s funeral pyre. The Blessed One need not trouble himself.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས། ཁྱིམ་བདག་མགོན་མེད་ཟས་སྦྱིན་ལ་ཅང་མི་གསུང་བས་གནང་ངོ་། །
en: The Blessed One assented by his silence.

source: དེ་ནས་ཁྱིམ་བདག་མགོན་མེད་ཟས་སྦྱིན་དང་། དགེ་བསྙེན་གཞན་དག་གིས་དགེ་སློང་དེའི་ཁྱོགས་ཁྱེར་ནས། དུར་ཁྲོད་དུ་ཆས་ཏེ།
en: Then householder Anāthapiṇḍada and the other lay vow holders, carrying the monk upon the palanquin, walked to the charnel grounds.

source: དེའི་ཕྱི་བཞིན་དུ་བཅོམ་ལྡན་འདས་དང་དགེ་སློང་གཞན་དག་དང་མཆོད་པ་དང་བཀུར་སྟི་བྱེད་པའི་དགེ་བསྙེན་དང་དགེ་བསྙེན་མ་རྣམས་ཀྱང་ཕྱི་བཞིན་དུ་འབྲང་སྟེ།
en: The Blessed One and the other monks followed them, along with the many lay vow holders performing ritual veneration and eulogy.

source: དེ་དག་གིས་དུར་ཁྲོད་དུ་ཁྱེར་ནས། སྤོས་ཀྱི་ཤིང་སྣ་ཚོགས་བཙེར་ཏེ་མེ་སྦར་ནས།
en: They bore the palanquin into the charnel ground, heaped together various types of incense, and lit the fire.

source: མེ་དེ་འོ་མས་བསད་དེ་རུས་པ་དེ་རྣམས་བསྡུས་ནས་བུམ་པའི་ནང་དུ་བཅུག་སྟེ་ས་ཕྱོགས་དེ་ཉིད་དུ་སྐུ་གདུང་གི་མཆོད་རྟེན་བརྩིགས་ནས།
en: They later extinguished the fire with milk, gathered up his bones, placed them in vessels, and built a reliquary stūpa there in the same place.

source: མཆོད་རྟེན་དེ་ལ་མཆོད་པ་ཆེན་པོ་བྱས་ཏེ་ཆོས་མཉན་པའི་ཕྱིར། སངས་རྒྱས་ཀྱི་སྤྱན་སྔར་འཁོད་ནས།
en: They performed a great offering ritual at the stūpa and then sat before the Buddha to listen to the Dharma.

source: བཅོམ་ལྡན་འདས་ཀྱིས་འཁོར་བཞི་པོ་རྣམས་ལ་མི་རྟག་པ་དང་ལྡན་པའི་གཏམ་བཀའ་སྩལ་ནས། གཙུག་ལག་ཁང་དུ་གཤེགས་སོ། །
en: The Blessed One gave a discourse on impermanence to all four retinues, then returned to the monastery.

source: དེ་ནས་དགེ་སློང་དག་གིས་བཅོམ་ལྡན་འདས་ལ་ཞུས་པ།
en: Then the monks inquired of the Blessed One,

source: དགེ་སློང་རྫོགས་བྱེད་ཀྱིས་ལས་ཅི་བགྱིས་ན། ལས་དེའི་རྣམ་པར་སྨིན་པས་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེས་ལ་ནད་མང་བར་གྱུར་ལགས།
en: “What action did the monk Pūraṇa take that ripened into his birth into a family of great means, prosperity, and wealth, and such that he became very ill?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་རྫོགས་བྱེད་འདི་ཉིད་ཀྱིས་སྔོན་ལས་བྱས་ཤིང་བསགས་ཏེ
en: “Monks,” explained the Blessed One, “ Pūraṇa committed and accumulated the actions himself at a previous time.

source: དགེ་སློང་དག་ལས་བྱས་ཤིང་བསགས་པ་རྣམས་ནི། ཕྱི་རོལ་གྱི་སའི་ཁམས་ལ་རྣམ་པར་སྨིན་པར་མི་འགྱུར། ཆུའི་ཁམས་དང་། མེའི་ཁམས་དང་། རླུང་གི་ཁམས་ལ་རྣམ་པར་སྨིན་པར་མི་འགྱུར་ཏེ།
en: Monks, the actions that Pūraṇa committed and accumulated did not ripen into the external element of earth, the element of water, the element of fire, or the element of wind.

source: ལས་དགེ་བ་དང་མི་དགེ་བ་བྱས་ཤིང་བསགས་པ་རྣམས་ནི། ཟིན་པའི་ཕུང་པོ་དང་། ཁམས་དང་སྐྱེ་མཆེད་རྣམས་འབའ་ཞིག་ལ་རྣམ་པར་སྨིན་པར་འགྱུར་རོ། །
en: The actions he committed and accumulated, both virtuous and nonvirtuous, ripened into nothing but his own aggregates, sense bases, and constituent elements.

source: དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན། བསྐལ་པ་བཟང་པོ་འདི་ཉིད་ལ། སྐྱེ་དགུའི་ཚེ་ལོ་བཞི་ཁྲི་ཐུབ་པ་ན།
en: “Monks, in times past, in this fortunate eon, when people lived as long as forty thousand years,

source: རྒྱལ་པོའི་ཕོ་བྲང་བདེ་ལྡན་ན། རྒྱལ་པོ་བདེ་བའི་མདུན་ན་འདོན་པ། བྲམ་ཟེ་མེས་བྱིན་ལ་བུ་གཉིས་ཡོད་པ་ལས་
en: in the royal palace Śobhāvatī there was a brahmin named Agnidatta who was King Śobha’s minister. Agnidatta had two sons,

source: གཅིག་གིས་ནི་རྒན་པོ་དང་། ནད་པ་དང་ཤི་བ་མཐོང་ནས་ནགས་ཀྱི་ནང་དུ་རྟེན་བཅས་ཏེ
en: one of whom, upon witnessing old age, sickness, and death, had gone to live in the forest.

source: དེ་དེར་སོང་ནས་བྱང་ཆུབ་ཀྱི་ཕྱོགས་དང་འཐུན་པའི་ཆོས་སུམ་ཅུ་རྩ་བདུན་དྲན་པར་བྱས་ནས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་བརྙེས་ཏེ།
en: There, contemplating the thirty-seven wings of enlightenment, he attained unexcelled, total, and complete enlightenment,
